{
    "architectures": ["DFlashDraftModel"],
    "model_type": "dflash",
    "hidden_size": 4096,
    "intermediate_size": 12288,
    "num_hidden_layers": 5,
    "num_attention_heads": 32,
    "num_key_value_heads": 8,
    "vocab_size": 151936,
    "rms_norm_eps": 1e-6,
    "max_position_embeddings": 40960,
    "rope_theta": 1000000.0,
    "num_target_layers": 5,
    "target_hidden_size": 4096,
    "target_num_hidden_layers": 36,
    "target_layer_ids": [1, 9, 17, 25, 33],
    "mask_token_id": 151669,
    "tie_word_embeddings": false
}
